---
kind: method
id: M:Autodesk.Revit.DB.TableData.Dispose
source: html/51795d34-2cc1-a54f-26ac-c6876d778f60.htm
---
# Autodesk.Revit.DB.TableData.Dispose Method

Releases all resources used by the TableData

## Syntax (C#)
```csharp
public void Dispose()
```